## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 2 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                        NAME                                         |
|--------|-------------------------------------------------------------------------------------|
| add    | `aws_kms_key.sns_cloudwatch`                                                        |
|        | `aws_sns_topic.cloudwatch_alarm`                                                    |
|        | `aws_sns_topic_subscription.cloudwatch_alarm`                                       |
| delete | `module.cloudwatch_alarms_slack.aws_cloudwatch_log_group.notify_slack_lambda`       |
|        | `module.cloudwatch_alarms_slack.aws_iam_policy.notify_slack_lambda`                 |
|        | `module.cloudwatch_alarms_slack.aws_iam_role.notify_slack_lambda`                   |
|        | `module.cloudwatch_alarms_slack.aws_iam_role_policy_attachment.notify_slack_lambda` |
|        | `module.cloudwatch_alarms_slack.aws_lambda_function.notify_slack`                   |
|        | `module.cloudwatch_alarms_slack.aws_lambda_permission.notify_slack[0]`              |
| update | `aws_cloudwatch_metric_alarm.api_error`                                             |
|        | `aws_cloudwatch_metric_alarm.api_secret_detected`                                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.api_error will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "api_error" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ca-central-1:283582579564:internal-sre-alert",
        ] -> (known after apply)
        id                        = "GitHub secret scanning: error"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:283582579564:internal-sre-alert",
        ] -> (known after apply)
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.api_secret_detected will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "api_secret_detected" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ca-central-1:283582579564:internal-sre-alert",
        ] -> (known after apply)
        id                        = "GitHub secret scanning: secret detected"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_kms_key.sns_cloudwatch will be created
  + resource "aws_kms_key" "sns_cloudwatch" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for CloudWatch alarm SNS topic"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::283582579564:root"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic.cloudwatch_alarm will be created
  + resource "aws_sns_topic" "cloudwatch_alarm" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "github-secret-scanning-cloudwatch-alarm"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.cloudwatch_alarm will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_alarm" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.cloudwatch_alarms_slack.aws_cloudwatch_log_group.notify_slack_lambda will be destroyed
  # (because aws_cloudwatch_log_group.notify_slack_lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "notify_slack_lambda" {
      - arn               = "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/github-secret-scanning-notify-slack" -> null
      - id                = "/aws/lambda/github-secret-scanning-notify-slack" -> null
      - name              = "/aws/lambda/github-secret-scanning-notify-slack" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "CostCentre" = "github-secret-scanning-production"
        } -> null
      - tags_all          = {
          - "CostCentre" = "github-secret-scanning-production"
        } -> null
    }

  # module.cloudwatch_alarms_slack.aws_iam_policy.notify_slack_lambda will be destroyed
  # (because aws_iam_policy.notify_slack_lambda is not in configuration)
  - resource "aws_iam_policy" "notify_slack_lambda" {
      - arn       = "arn:aws:iam::283582579564:policy/NotifySlackLambda-github-secret-scanning-notify-slack" -> null
      - id        = "arn:aws:iam::283582579564:policy/NotifySlackLambda-github-secret-scanning-notify-slack" -> null
      - name      = "NotifySlackLambda-github-secret-scanning-notify-slack" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/github-secret-scanning-notify-slack"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAUEBWWYNWKCDMPXPK4" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.cloudwatch_alarms_slack.aws_iam_role.notify_slack_lambda will be destroyed
  # (because aws_iam_role.notify_slack_lambda is not in configuration)
  - resource "aws_iam_role" "notify_slack_lambda" {
      - arn                   = "arn:aws:iam::283582579564:role/NotifySlackLambda-github-secret-scanning-notify-slack" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-02-14T15:18:00Z" -> null
      - force_detach_policies = false -> null
      - id                    = "NotifySlackLambda-github-secret-scanning-notify-slack" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::283582579564:policy/NotifySlackLambda-github-secret-scanning-notify-slack",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "NotifySlackLambda-github-secret-scanning-notify-slack" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAUEBWWYNWGWAIT222K" -> null
    }

  # module.cloudwatch_alarms_slack.aws_iam_role_policy_attachment.notify_slack_lambda will be destroyed
  # (because aws_iam_role_policy_attachment.notify_slack_lambda is not in configuration)
  - resource "aws_iam_role_policy_attachment" "notify_slack_lambda" {
      - id         = "NotifySlackLambda-github-secret-scanning-notify-slack-20230214151800435700000001" -> null
      - policy_arn = "arn:aws:iam::283582579564:policy/NotifySlackLambda-github-secret-scanning-notify-slack" -> null
      - role       = "NotifySlackLambda-github-secret-scanning-notify-slack" -> null
    }

  # module.cloudwatch_alarms_slack.aws_lambda_function.notify_slack will be destroyed
  # (because aws_lambda_function.notify_slack is not in configuration)
  - resource "aws_lambda_function" "notify_slack" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:283582579564:function:github-secret-scanning-notify-slack" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "Lambda function to post CloudWatch alarm notifications to a Slack channel." -> null
      - filename                       = "/tmp/notify_slack.py.zip" -> null
      - function_name                  = "github-secret-scanning-notify-slack" -> null
      - handler                        = "notify_slack.lambda_handler" -> null
      - id                             = "github-secret-scanning-notify-slack" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:283582579564:function:github-secret-scanning-notify-slack/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2023-02-14T15:18:14.070+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:283582579564:function:github-secret-scanning-notify-slack:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:283582579564:function:github-secret-scanning-notify-slack:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::283582579564:role/NotifySlackLambda-github-secret-scanning-notify-slack" -> null
      - runtime                        = "python3.8" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "iC0Ta5b8fs9u6i/c3LA3/Tk8BUHfS6Jgq4NF8At0CBo=" -> null
      - source_code_size               = 1613 -> null
      - tags                           = {
          - "CostCentre" = "github-secret-scanning-production"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "github-secret-scanning-production"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "LOG_EVENTS"        = "True"
              - "PROJECT_NAME"      = "github-secret-scanning"
              - "SLACK_WEBHOOK_URL" = (sensitive value)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.cloudwatch_alarms_slack.aws_lambda_permission.notify_slack[0] will be destroyed
  # (because aws_lambda_permission.notify_slack is not in configuration)
  - resource "aws_lambda_permission" "notify_slack" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "github-secret-scanning-notify-slack" -> null
      - id            = "AllowExecutionFromSNS-github-secret-scanning-notify-slack-0" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:283582579564:internal-sre-alert" -> null
      - statement_id  = "AllowExecutionFromSNS-github-secret-scanning-notify-slack-0" -> null
    }

Plan: 3 to add, 2 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.api_error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.api_secret_detected"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_secret_detected"]

20 tests, 16 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
